org/20201119093701-epidemics_on_networks.org
#+setupfile:./hugo_setup.org
#+title: Epidemics on Networks
#+ROAM_TAGS: "Network Science"

- Analysis of infection spread
  + In theory we should consider everything
  + In practice we can only model some of them
- Model 1: Mass-action approximation (every individual has equal chance for contact)
- Model 2: Network based

* S(usceptible)-I(nfected) Model
- Someone who doesn't have the disease but coould catch it is /susceptible/
- Someone who has the disease nd can pass it to a susceptible is /infected/
- $n$ individuals, $S(t)$ is number of susceptible individuals at $t$, and $X(t)$ is infected at time $t$
- $s = S/n$, $x = X/n$
- $S, X$ are expectations of $S(t), X(t)$ if we run this process many times
- $\beta$ is contact per-individual
- Average rate of new infections
\begin{eqnarray}
\label{eq:1}
X \beta \frac{S}{n} \rightarrow \frac{dX}{dt} = X \beta \frac{S}{n} \text{ or } \frac{dx}{dt} = \beta(1-x)x
\end{eqnarray}
- The solution to this is a logistic growth curve
* S(usceptible)-I(nfected)-R(ecovered) Model
- Similar differential model but with an extra parameter for I to R
- $R(t)$ number of recovered at $t$
- \gamma is the recovery rate
- $\frac{ds}{dt} = -\beta sx$
- $\frac{dx}{dt} = \beta sx - \gamma x$
- $\frac{dr}{dt} = \gamma x$
- $s + x + r = 1$
- Epidemic threshold: transition to epidemic regimes at $\beta = \gamma$
- $R_{0}=\frac{\beta}{\gamma}$
* S(usceptible)-I(nfected)-S(usceptible) Model
- Individuals can be reinfected
